Accuracy:      0.9680522157334249
F1:            0.960394679498461
Confusion mat:
 [[ 769   40]
 [  53 2049]]
Acc per class: [0.95055624 0.97478592]
AUROC:    0.9626710802237906
AUPRC:    0.9743275994583345

Model: "RNN_Transfer_Freeze_Bidirectional"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_82 (InputLayer)        [(None, 187, 1)]          0         
_________________________________________________________________
bidirectional_70 (Bidirectio (None, 200)               82400     
_________________________________________________________________
dense_26 (Dense)             (None, 200)               40200     
_________________________________________________________________
dropout_113 (Dropout)        (None, 200)               0         
_________________________________________________________________
out_layer (Dense)            (None, 1)                 201       
=================================================================
Total params: 122,801
Trainable params: 40,401
Non-trainable params: 82,400
_________________________________________________________________
