Model: "average ensemble"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_33 (InputLayer)           [(None, 187, 1)]     0                                            
__________________________________________________________________________________________________
Baseline_PTB (Model)            (None, 1)            254641      input_33[0][0]                   
__________________________________________________________________________________________________
RNN_PTB_Bidirectional (Model)   (None, 1)            244001      input_33[0][0]                   
__________________________________________________________________________________________________
Conv_RNN_PTB_Bidirectional (Mod (None, 1)            231649      input_33[0][0]                   
__________________________________________________________________________________________________
model_1 (Model)                 (None, 1)            81985       input_33[0][0]                   
__________________________________________________________________________________________________
RNN_Transfer_Retrain_Bidirectio (None, 1)            122801      input_33[0][0]                   
__________________________________________________________________________________________________
Baseline_Transfer_Retrain (Mode (None, 1)            254641      input_33[0][0]                   
__________________________________________________________________________________________________
Conv_RNN_Transfer_Retrain_Bidir (None, 1)            126449      input_33[0][0]                   
__________________________________________________________________________________________________
model_45 (Model)                (None, 1)            81985       input_33[0][0]                   
__________________________________________________________________________________________________
average (Average)               (None, 1)            0           Baseline_PTB[1][0]               
                                                                 RNN_PTB_Bidirectional[1][0]      
                                                                 Conv_RNN_PTB_Bidirectional[1][0] 
                                                                 model_1[1][0]                    
                                                                 RNN_Transfer_Retrain_Bidirectiona
                                                                 Baseline_Transfer_Retrain[1][0]  
                                                                 Conv_RNN_Transfer_Retrain_Bidirec
                                                                 model_45[1][0]                   
==================================================================================================
Total params: 1,398,152
Trainable params: 1,396,872
Non-trainable params: 1,280
__________________________________________________________________________________________________
