Accuracy:      0.9203023016145654
F1:            0.8997909616121952
Confusion mat:
 [[ 681  128]
 [ 104 1998]]
Acc per class: [0.84177998 0.95052331]
AUROC:    0.8961516432051881
AUPRC:    0.929021745249323

Model: "model_49"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_67 (InputLayer)        [(None, 187, 1)]          0         
_________________________________________________________________
conv1d_444 (Conv1D)          (None, 185, 16)           64        
_________________________________________________________________
conv1d_445 (Conv1D)          (None, 183, 16)           784       
_________________________________________________________________
max_pooling1d_91 (MaxPooling (None, 91, 16)            0         
_________________________________________________________________
dropout_118 (Dropout)        (None, 91, 16)            0         
_________________________________________________________________
conv1d_446 (Conv1D)          (None, 89, 32)            1568      
_________________________________________________________________
conv1d_447 (Conv1D)          (None, 87, 32)            3104      
_________________________________________________________________
max_pooling1d_92 (MaxPooling (None, 43, 32)            0         
_________________________________________________________________
dropout_119 (Dropout)        (None, 43, 32)            0         
_________________________________________________________________
batch_normalization_191 (Bat (None, 43, 32)            128       
_________________________________________________________________
rnn (CuDNNGRU)               (None, 150)               82800     
_________________________________________________________________
dense (Dense)                (None, 200)               30200     
_________________________________________________________________
out_layer (Dense)            (None, 1)                 201       
=================================================================
Total params: 118,849
Trainable params: 30,401
Non-trainable params: 88,448
_________________________________________________________________
