Model: "RNN_MIT_Bidirectional"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 187, 1)]          0         
_________________________________________________________________
bidirectional (Bidirectional (None, 300)               183600    
_________________________________________________________________
dense (Dense)                (None, 200)               60200     
_________________________________________________________________
dropout (Dropout)            (None, 200)               0         
_________________________________________________________________
out_layer (Dense)            (None, 5)                 1005      
=================================================================
Total params: 244,805
Trainable params: 244,805
Non-trainable params: 0
_________________________________________________________________
