Accuracy:      0.7220886293369976
F1:            0.4193097945342111
Confusion mat:
 [[   0  809]
 [   0 2102]]
Acc per class: [0. 1.]
AUROC:    0.5
AUPRC:    0.7220886293369976

Model: "model_41"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_57 (InputLayer)        [(None, 187, 1)]          0         
_________________________________________________________________
cu_dnnlstm_7 (CuDNNLSTM)     (None, 150)               91800     
_________________________________________________________________
dense_7 (Dense)              (None, 200)               30200     
_________________________________________________________________
dropout_101 (Dropout)        (None, 200)               0         
_________________________________________________________________
out_layer (Dense)            (None, 1)                 201       
=================================================================
Total params: 122,201
Trainable params: 122,201
Non-trainable params: 0
_________________________________________________________________
