Accuracy:      0.9920989350738578
F1:            0.9901532248398224
Confusion mat:
 [[ 797   12]
 [  11 2091]]
Acc per class: [0.98516687 0.99476689]
AUROC:    0.9899668806798869
AUPRC:    0.9928693856003029

Model: "Baseline_Transfer_Retrain"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_55 (InputLayer)        [(None, 187, 1)]          0         
_________________________________________________________________
conv1d_384 (Conv1D)          (None, 183, 16)           96        
_________________________________________________________________
conv1d_385 (Conv1D)          (None, 179, 16)           1296      
_________________________________________________________________
max_pooling1d_76 (MaxPooling (None, 89, 16)            0         
_________________________________________________________________
dropout_96 (Dropout)         (None, 89, 16)            0         
_________________________________________________________________
conv1d_386 (Conv1D)          (None, 87, 32)            1568      
_________________________________________________________________
conv1d_387 (Conv1D)          (None, 85, 32)            3104      
_________________________________________________________________
max_pooling1d_77 (MaxPooling (None, 42, 32)            0         
_________________________________________________________________
dropout_97 (Dropout)         (None, 42, 32)            0         
_________________________________________________________________
conv1d_388 (Conv1D)          (None, 40, 32)            3104      
_________________________________________________________________
conv1d_389 (Conv1D)          (None, 38, 32)            3104      
_________________________________________________________________
max_pooling1d_78 (MaxPooling (None, 19, 32)            0         
_________________________________________________________________
dropout_98 (Dropout)         (None, 19, 32)            0         
_________________________________________________________________
conv1d_390 (Conv1D)          (None, 17, 256)           24832     
_________________________________________________________________
conv1d_391 (Conv1D)          (None, 15, 256)           196864    
_________________________________________________________________
global_max_pooling1d_31 (Glo (None, 256)               0         
_________________________________________________________________
dropout_99 (Dropout)         (None, 256)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 64)                16448     
_________________________________________________________________
dense_2 (Dense)              (None, 64)                4160      
_________________________________________________________________
dense_3_mitbih (Dense)       (None, 1)                 65        
=================================================================
Total params: 254,641
Trainable params: 254,641
Non-trainable params: 0
_________________________________________________________________

=================================================================
Accuracy:      0.9920989350738578
F1:            0.9901532248398224
Confusion mat:
 [[ 797   12]
 [  11 2091]]
Acc per class: [0.98516687 0.99476689]
AUROC:    0.9899668806798869
AUPRC:    0.9928693856003029


=================================================================
