Accuracy:      0.9850630367257446
F1:            0.9145959401334487
Confusion mat:
 [[18066    23    18     8     3]
 [  154   391    10     1     0]
 [   42     1  1387    15     3]
 [   13     0    19   130     0]
 [   15     0     1     1  1591]]
Acc per class: [0.99712993 0.70323741 0.95787293 0.80246914 0.98942786]
Model: "model_2"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_6 (InputLayer)            [(None, 187, 1)]     0                                            
__________________________________________________________________________________________________
conv1d_20 (Conv1D)              (None, 183, 32)      192         input_6[0][0]                    
__________________________________________________________________________________________________
batch_normalization_12 (BatchNo (None, 183, 32)      128         conv1d_20[0][0]                  
__________________________________________________________________________________________________
re_lu_10 (ReLU)                 (None, 183, 32)      0           batch_normalization_12[0][0]     
__________________________________________________________________________________________________
conv1d_22 (Conv1D)              (None, 183, 32)      3104        re_lu_10[0][0]                   
__________________________________________________________________________________________________
batch_normalization_13 (BatchNo (None, 183, 32)      128         conv1d_22[0][0]                  
__________________________________________________________________________________________________
re_lu_11 (ReLU)                 (None, 183, 32)      0           batch_normalization_13[0][0]     
__________________________________________________________________________________________________
conv1d_23 (Conv1D)              (None, 183, 32)      3104        re_lu_11[0][0]                   
__________________________________________________________________________________________________
add_5 (Add)                     (None, 183, 32)      0           conv1d_23[0][0]                  
                                                                 conv1d_20[0][0]                  
__________________________________________________________________________________________________
batch_normalization_14 (BatchNo (None, 183, 32)      128         add_5[0][0]                      
__________________________________________________________________________________________________
re_lu_12 (ReLU)                 (None, 183, 32)      0           batch_normalization_14[0][0]     
__________________________________________________________________________________________________
conv1d_24 (Conv1D)              (None, 183, 32)      3104        re_lu_12[0][0]                   
__________________________________________________________________________________________________
batch_normalization_15 (BatchNo (None, 183, 32)      128         conv1d_24[0][0]                  
__________________________________________________________________________________________________
re_lu_13 (ReLU)                 (None, 183, 32)      0           batch_normalization_15[0][0]     
__________________________________________________________________________________________________
conv1d_25 (Conv1D)              (None, 183, 32)      3104        re_lu_13[0][0]                   
__________________________________________________________________________________________________
add_6 (Add)                     (None, 183, 32)      0           conv1d_25[0][0]                  
                                                                 add_5[0][0]                      
__________________________________________________________________________________________________
batch_normalization_16 (BatchNo (None, 183, 32)      128         add_6[0][0]                      
__________________________________________________________________________________________________
re_lu_14 (ReLU)                 (None, 183, 32)      0           batch_normalization_16[0][0]     
__________________________________________________________________________________________________
conv1d_26 (Conv1D)              (None, 183, 32)      3104        re_lu_14[0][0]                   
__________________________________________________________________________________________________
batch_normalization_17 (BatchNo (None, 183, 32)      128         conv1d_26[0][0]                  
__________________________________________________________________________________________________
re_lu_15 (ReLU)                 (None, 183, 32)      0           batch_normalization_17[0][0]     
__________________________________________________________________________________________________
conv1d_27 (Conv1D)              (None, 183, 32)      3104        re_lu_15[0][0]                   
__________________________________________________________________________________________________
add_7 (Add)                     (None, 183, 32)      0           conv1d_27[0][0]                  
                                                                 add_6[0][0]                      
__________________________________________________________________________________________________
batch_normalization_18 (BatchNo (None, 183, 32)      128         add_7[0][0]                      
__________________________________________________________________________________________________
re_lu_16 (ReLU)                 (None, 183, 32)      0           batch_normalization_18[0][0]     
__________________________________________________________________________________________________
conv1d_28 (Conv1D)              (None, 183, 32)      3104        re_lu_16[0][0]                   
__________________________________________________________________________________________________
batch_normalization_19 (BatchNo (None, 183, 32)      128         conv1d_28[0][0]                  
__________________________________________________________________________________________________
re_lu_17 (ReLU)                 (None, 183, 32)      0           batch_normalization_19[0][0]     
__________________________________________________________________________________________________
conv1d_29 (Conv1D)              (None, 183, 32)      3104        re_lu_17[0][0]                   
__________________________________________________________________________________________________
add_8 (Add)                     (None, 183, 32)      0           conv1d_29[0][0]                  
                                                                 add_7[0][0]                      
__________________________________________________________________________________________________
conv1d_30 (Conv1D)              (None, 183, 32)      5152        add_8[0][0]                      
__________________________________________________________________________________________________
conv1d_21 (Conv1D)              (None, 183, 32)      5152        conv1d_20[0][0]                  
__________________________________________________________________________________________________
add_9 (Add)                     (None, 183, 32)      0           conv1d_30[0][0]                  
                                                                 conv1d_21[0][0]                  
__________________________________________________________________________________________________
batch_normalization_20 (BatchNo (None, 183, 32)      128         add_9[0][0]                      
__________________________________________________________________________________________________
conv1d_31 (Conv1D)              (None, 181, 256)     24832       batch_normalization_20[0][0]     
__________________________________________________________________________________________________
global_max_pooling1d_1 (GlobalM (None, 256)          0           conv1d_31[0][0]                  
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 64)           16448       global_max_pooling1d_1[0][0]     
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 64)           4160        dense_1[0][0]                    
__________________________________________________________________________________________________
output_layer (Dense)            (None, 5)            325         dense_2[0][0]                    
==================================================================================================
Total params: 82,245
Trainable params: 81,669
Non-trainable params: 576
__________________________________________________________________________________________________

=================================================================
Accuracy:      0.9850630367257446
F1:            0.9145959401334487
Confusion mat:
 [[18066    23    18     8     3]
 [  154   391    10     1     0]
 [   42     1  1387    15     3]
 [   13     0    19   130     0]
 [   15     0     1     1  1591]]
Acc per class: [0.99712993 0.70323741 0.95787293 0.80246914 0.98942786]

=================================================================
