Accuracy:      0.9931295087598764
F1:            0.9914277872795548
Confusion mat:
 [[ 797   12]
 [   8 2094]]
Acc per class: [0.98516687 0.9961941 ]
AUROC:    0.9906804867693256
AUPRC:    0.9932659776893777

Model: "model_43"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_59 (InputLayer)        [(None, 187, 1)]          0         
_________________________________________________________________
conv1d_396 (Conv1D)          (None, 185, 16)           64        
_________________________________________________________________
conv1d_397 (Conv1D)          (None, 183, 16)           784       
_________________________________________________________________
max_pooling1d_81 (MaxPooling (None, 91, 16)            0         
_________________________________________________________________
dropout_104 (Dropout)        (None, 91, 16)            0         
_________________________________________________________________
conv1d_398 (Conv1D)          (None, 89, 32)            1568      
_________________________________________________________________
conv1d_399 (Conv1D)          (None, 87, 32)            3104      
_________________________________________________________________
max_pooling1d_82 (MaxPooling (None, 43, 32)            0         
_________________________________________________________________
dropout_105 (Dropout)        (None, 43, 32)            0         
_________________________________________________________________
batch_normalization_171 (Bat (None, 43, 32)            128       
_________________________________________________________________
rnn (CuDNNGRU)               (None, 150)               82800     
_________________________________________________________________
dense (Dense)                (None, 200)               30200     
_________________________________________________________________
out_layer (Dense)            (None, 1)                 201       
=================================================================
Total params: 118,849
Trainable params: 118,785
Non-trainable params: 64
_________________________________________________________________
