Accuracy: 0.9920989350738578
F1:       0.9901457176267477
AUROC:    0.9895867024047967
AUPRC:    0.9925314801755468

Model: "model_26"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_30 (InputLayer)           [(None, 187, 1)]     0                                            
__________________________________________________________________________________________________
conv1d_172 (Conv1D)             (None, 183, 32)      192         input_30[0][0]                   
__________________________________________________________________________________________________
batch_normalization_29 (BatchNo (None, 183, 32)      128         conv1d_172[0][0]                 
__________________________________________________________________________________________________
re_lu_24 (ReLU)                 (None, 183, 32)      0           batch_normalization_29[0][0]     
__________________________________________________________________________________________________
conv1d_174 (Conv1D)             (None, 183, 32)      3104        re_lu_24[0][0]                   
__________________________________________________________________________________________________
batch_normalization_30 (BatchNo (None, 183, 32)      128         conv1d_174[0][0]                 
__________________________________________________________________________________________________
re_lu_25 (ReLU)                 (None, 183, 32)      0           batch_normalization_30[0][0]     
__________________________________________________________________________________________________
conv1d_175 (Conv1D)             (None, 183, 32)      3104        re_lu_25[0][0]                   
__________________________________________________________________________________________________
add_15 (Add)                    (None, 183, 32)      0           conv1d_175[0][0]                 
                                                                 conv1d_172[0][0]                 
__________________________________________________________________________________________________
batch_normalization_31 (BatchNo (None, 183, 32)      128         add_15[0][0]                     
__________________________________________________________________________________________________
re_lu_26 (ReLU)                 (None, 183, 32)      0           batch_normalization_31[0][0]     
__________________________________________________________________________________________________
conv1d_176 (Conv1D)             (None, 183, 32)      3104        re_lu_26[0][0]                   
__________________________________________________________________________________________________
batch_normalization_32 (BatchNo (None, 183, 32)      128         conv1d_176[0][0]                 
__________________________________________________________________________________________________
re_lu_27 (ReLU)                 (None, 183, 32)      0           batch_normalization_32[0][0]     
__________________________________________________________________________________________________
conv1d_177 (Conv1D)             (None, 183, 32)      3104        re_lu_27[0][0]                   
__________________________________________________________________________________________________
add_16 (Add)                    (None, 183, 32)      0           conv1d_177[0][0]                 
                                                                 add_15[0][0]                     
__________________________________________________________________________________________________
batch_normalization_33 (BatchNo (None, 183, 32)      128         add_16[0][0]                     
__________________________________________________________________________________________________
re_lu_28 (ReLU)                 (None, 183, 32)      0           batch_normalization_33[0][0]     
__________________________________________________________________________________________________
conv1d_178 (Conv1D)             (None, 183, 32)      3104        re_lu_28[0][0]                   
__________________________________________________________________________________________________
batch_normalization_34 (BatchNo (None, 183, 32)      128         conv1d_178[0][0]                 
__________________________________________________________________________________________________
re_lu_29 (ReLU)                 (None, 183, 32)      0           batch_normalization_34[0][0]     
__________________________________________________________________________________________________
conv1d_179 (Conv1D)             (None, 183, 32)      3104        re_lu_29[0][0]                   
__________________________________________________________________________________________________
add_17 (Add)                    (None, 183, 32)      0           conv1d_179[0][0]                 
                                                                 add_16[0][0]                     
__________________________________________________________________________________________________
batch_normalization_35 (BatchNo (None, 183, 32)      128         add_17[0][0]                     
__________________________________________________________________________________________________
re_lu_30 (ReLU)                 (None, 183, 32)      0           batch_normalization_35[0][0]     
__________________________________________________________________________________________________
conv1d_180 (Conv1D)             (None, 183, 32)      3104        re_lu_30[0][0]                   
__________________________________________________________________________________________________
batch_normalization_36 (BatchNo (None, 183, 32)      128         conv1d_180[0][0]                 
__________________________________________________________________________________________________
re_lu_31 (ReLU)                 (None, 183, 32)      0           batch_normalization_36[0][0]     
__________________________________________________________________________________________________
conv1d_181 (Conv1D)             (None, 183, 32)      3104        re_lu_31[0][0]                   
__________________________________________________________________________________________________
add_18 (Add)                    (None, 183, 32)      0           conv1d_181[0][0]                 
                                                                 add_17[0][0]                     
__________________________________________________________________________________________________
conv1d_182 (Conv1D)             (None, 183, 32)      5152        add_18[0][0]                     
__________________________________________________________________________________________________
conv1d_173 (Conv1D)             (None, 183, 32)      5152        conv1d_172[0][0]                 
__________________________________________________________________________________________________
add_19 (Add)                    (None, 183, 32)      0           conv1d_182[0][0]                 
                                                                 conv1d_173[0][0]                 
__________________________________________________________________________________________________
batch_normalization_37 (BatchNo (None, 183, 32)      128         add_19[0][0]                     
__________________________________________________________________________________________________
conv1d_183 (Conv1D)             (None, 181, 256)     24832       batch_normalization_37[0][0]     
__________________________________________________________________________________________________
global_max_pooling1d_19 (Global (None, 256)          0           conv1d_183[0][0]                 
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 64)           16448       global_max_pooling1d_19[0][0]    
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 64)           4160        dense_1[0][0]                    
__________________________________________________________________________________________________
output_layer (Dense)            (None, 1)            65          dense_2[0][0]                    
==================================================================================================
Total params: 81,985
Trainable params: 81,409
Non-trainable params: 576
__________________________________________________________________________________________________

=================================================================
Accuracy:      0.9945036070079011
F1:            0.9931369833139811
Confusion mat:
 [[ 798   11]
 [   5 2097]]
Acc per class: [0.98640297 0.99762131]
AUROC:    0.992012139830334
AUPRC:    0.9941331320295869


=================================================================

=================================================================
Accuracy:      0.9969082789419443
F1:            0.9961498426739217
Confusion mat:
 [[ 805    4]
 [   5 2097]]
Acc per class: [0.99505562 0.99762131]
AUROC:    0.9963384686313229
AUPRC:    0.9974396092140404


=================================================================

=================================================================
Accuracy:      0.9969082789419443
F1:            0.9961498426739217
Confusion mat:
 [[ 805    4]
 [   5 2097]]
Acc per class: [0.99505562 0.99762131]
AUROC:    0.9963384686313229
AUPRC:    0.9974396092140404


=================================================================
