Model: "model_1"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_16 (InputLayer)           [(None, 187, 1)]     0                                            
__________________________________________________________________________________________________
conv1d_64 (Conv1D)              (None, 183, 32)      192         input_16[0][0]                   
__________________________________________________________________________________________________
batch_normalization_14 (BatchNo (None, 183, 32)      128         conv1d_64[0][0]                  
__________________________________________________________________________________________________
re_lu_8 (ReLU)                  (None, 183, 32)      0           batch_normalization_14[0][0]     
__________________________________________________________________________________________________
conv1d_66 (Conv1D)              (None, 183, 32)      3104        re_lu_8[0][0]                    
__________________________________________________________________________________________________
batch_normalization_15 (BatchNo (None, 183, 32)      128         conv1d_66[0][0]                  
__________________________________________________________________________________________________
re_lu_9 (ReLU)                  (None, 183, 32)      0           batch_normalization_15[0][0]     
__________________________________________________________________________________________________
conv1d_67 (Conv1D)              (None, 183, 32)      3104        re_lu_9[0][0]                    
__________________________________________________________________________________________________
add_5 (Add)                     (None, 183, 32)      0           conv1d_67[0][0]                  
                                                                 conv1d_64[0][0]                  
__________________________________________________________________________________________________
batch_normalization_16 (BatchNo (None, 183, 32)      128         add_5[0][0]                      
__________________________________________________________________________________________________
re_lu_10 (ReLU)                 (None, 183, 32)      0           batch_normalization_16[0][0]     
__________________________________________________________________________________________________
conv1d_68 (Conv1D)              (None, 183, 32)      3104        re_lu_10[0][0]                   
__________________________________________________________________________________________________
batch_normalization_17 (BatchNo (None, 183, 32)      128         conv1d_68[0][0]                  
__________________________________________________________________________________________________
re_lu_11 (ReLU)                 (None, 183, 32)      0           batch_normalization_17[0][0]     
__________________________________________________________________________________________________
conv1d_69 (Conv1D)              (None, 183, 32)      3104        re_lu_11[0][0]                   
__________________________________________________________________________________________________
add_6 (Add)                     (None, 183, 32)      0           conv1d_69[0][0]                  
                                                                 add_5[0][0]                      
__________________________________________________________________________________________________
batch_normalization_18 (BatchNo (None, 183, 32)      128         add_6[0][0]                      
__________________________________________________________________________________________________
re_lu_12 (ReLU)                 (None, 183, 32)      0           batch_normalization_18[0][0]     
__________________________________________________________________________________________________
conv1d_70 (Conv1D)              (None, 183, 32)      3104        re_lu_12[0][0]                   
__________________________________________________________________________________________________
batch_normalization_19 (BatchNo (None, 183, 32)      128         conv1d_70[0][0]                  
__________________________________________________________________________________________________
re_lu_13 (ReLU)                 (None, 183, 32)      0           batch_normalization_19[0][0]     
__________________________________________________________________________________________________
conv1d_71 (Conv1D)              (None, 183, 32)      3104        re_lu_13[0][0]                   
__________________________________________________________________________________________________
add_7 (Add)                     (None, 183, 32)      0           conv1d_71[0][0]                  
                                                                 add_6[0][0]                      
__________________________________________________________________________________________________
batch_normalization_20 (BatchNo (None, 183, 32)      128         add_7[0][0]                      
__________________________________________________________________________________________________
re_lu_14 (ReLU)                 (None, 183, 32)      0           batch_normalization_20[0][0]     
__________________________________________________________________________________________________
conv1d_72 (Conv1D)              (None, 183, 32)      3104        re_lu_14[0][0]                   
__________________________________________________________________________________________________
batch_normalization_21 (BatchNo (None, 183, 32)      128         conv1d_72[0][0]                  
__________________________________________________________________________________________________
re_lu_15 (ReLU)                 (None, 183, 32)      0           batch_normalization_21[0][0]     
__________________________________________________________________________________________________
conv1d_73 (Conv1D)              (None, 183, 32)      3104        re_lu_15[0][0]                   
__________________________________________________________________________________________________
add_8 (Add)                     (None, 183, 32)      0           conv1d_73[0][0]                  
                                                                 add_7[0][0]                      
__________________________________________________________________________________________________
conv1d_74 (Conv1D)              (None, 183, 32)      5152        add_8[0][0]                      
__________________________________________________________________________________________________
conv1d_65 (Conv1D)              (None, 183, 32)      5152        conv1d_64[0][0]                  
__________________________________________________________________________________________________
add_9 (Add)                     (None, 183, 32)      0           conv1d_74[0][0]                  
                                                                 conv1d_65[0][0]                  
__________________________________________________________________________________________________
batch_normalization_22 (BatchNo (None, 183, 32)      128         add_9[0][0]                      
__________________________________________________________________________________________________
conv1d_75 (Conv1D)              (None, 181, 256)     24832       batch_normalization_22[0][0]     
__________________________________________________________________________________________________
global_max_pooling1d_5 (GlobalM (None, 256)          0           conv1d_75[0][0]                  
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 64)           16448       global_max_pooling1d_5[0][0]     
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 64)           4160        dense_1[0][0]                    
__________________________________________________________________________________________________
output_layer (Dense)            (None, 1)            65          dense_2[0][0]                    
==================================================================================================
Total params: 81,985
Trainable params: 81,409
Non-trainable params: 576
__________________________________________________________________________________________________
