Accuracy:      0.9846976064315732
F1:            0.9079062250834496
Confusion mat:
 [[18050    40    23     2     3]
 [  122   416    13     3     2]
 [   36     2  1391    14     5]
 [   29     1    17   115     0]
 [   19     0     4     0  1585]]
Acc per class: [0.99624683 0.74820144 0.96063536 0.70987654 0.98569652]
Model: "model_27"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_36 (InputLayer)        [(None, 187, 1)]          0         
_________________________________________________________________
conv1d_145 (Conv1D)          (None, 185, 16)           64        
_________________________________________________________________
conv1d_146 (Conv1D)          (None, 183, 16)           784       
_________________________________________________________________
max_pooling1d_57 (MaxPooling (None, 91, 16)            0         
_________________________________________________________________
dropout_93 (Dropout)         (None, 91, 16)            0         
_________________________________________________________________
conv1d_147 (Conv1D)          (None, 89, 32)            1568      
_________________________________________________________________
conv1d_148 (Conv1D)          (None, 87, 32)            3104      
_________________________________________________________________
max_pooling1d_58 (MaxPooling (None, 43, 32)            0         
_________________________________________________________________
dropout_94 (Dropout)         (None, 43, 32)            0         
_________________________________________________________________
batch_normalization_5 (Batch (None, 43, 32)            128       
_________________________________________________________________
rnn (CuDNNGRU)               (None, 150)               82800     
_________________________________________________________________
dense (Dense)                (None, 200)               30200     
_________________________________________________________________
out_layer (Dense)            (None, 5)                 1005      
=================================================================
Total params: 119,653
Trainable params: 119,589
Non-trainable params: 64
_________________________________________________________________
