Model: "Conv_RNN_PTB_Bidirectional"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_14 (InputLayer)        [(None, 187, 1)]          0         
_________________________________________________________________
conv1d_48 (Conv1D)           (None, 185, 16)           64        
_________________________________________________________________
conv1d_49 (Conv1D)           (None, 183, 16)           784       
_________________________________________________________________
max_pooling1d_20 (MaxPooling (None, 91, 16)            0         
_________________________________________________________________
dropout_29 (Dropout)         (None, 91, 16)            0         
_________________________________________________________________
conv1d_50 (Conv1D)           (None, 89, 32)            1568      
_________________________________________________________________
conv1d_51 (Conv1D)           (None, 87, 32)            3104      
_________________________________________________________________
max_pooling1d_21 (MaxPooling (None, 43, 32)            0         
_________________________________________________________________
dropout_30 (Dropout)         (None, 43, 32)            0         
_________________________________________________________________
batch_normalization_4 (Batch (None, 43, 32)            128       
_________________________________________________________________
bidirectional_9 (Bidirection (None, 300)               165600    
_________________________________________________________________
dense (Dense)                (None, 200)               60200     
_________________________________________________________________
out_layer (Dense)            (None, 1)                 201       
=================================================================
Total params: 231,649
Trainable params: 231,585
Non-trainable params: 64
_________________________________________________________________
