Accuracy:      0.9828237718996908
F1:            0.9786183534002033
Confusion mat:
 [[ 785   24]
 [  26 2076]]
Acc per class: [0.97033375 0.98763083]
AUROC:    0.9789822865738557
AUPRC:    0.9852752569348466

Model: "Conv_RNN_Transfer_Freeze_Bidirectional"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_86 (InputLayer)        [(None, 187, 1)]          0         
_________________________________________________________________
conv1d_202 (Conv1D)          (None, 185, 16)           64        
_________________________________________________________________
conv1d_203 (Conv1D)          (None, 183, 16)           784       
_________________________________________________________________
max_pooling1d_86 (MaxPooling (None, 91, 16)            0         
_________________________________________________________________
dropout_118 (Dropout)        (None, 91, 16)            0         
_________________________________________________________________
conv1d_204 (Conv1D)          (None, 89, 32)            1568      
_________________________________________________________________
conv1d_205 (Conv1D)          (None, 87, 32)            3104      
_________________________________________________________________
max_pooling1d_87 (MaxPooling (None, 43, 32)            0         
_________________________________________________________________
dropout_119 (Dropout)        (None, 43, 32)            0         
_________________________________________________________________
batch_normalization_63 (Batc (None, 43, 32)            128       
_________________________________________________________________
bidirectional_74 (Bidirectio (None, 200)               80400     
_________________________________________________________________
dense (Dense)                (None, 200)               40200     
_________________________________________________________________
out_layer (Dense)            (None, 1)                 201       
=================================================================
Total params: 126,449
Trainable params: 40,401
Non-trainable params: 86,048
_________________________________________________________________
