Model: "average ensemble"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_24 (InputLayer)           [(None, 187, 1)]     0                                            
__________________________________________________________________________________________________
Baseline_MIT (Model)            (None, 5)            254901      input_24[0][0]                   
__________________________________________________________________________________________________
Conv_RNN_MIT_Bidirectional (Mod (None, 5)            127253      input_24[0][0]                   
__________________________________________________________________________________________________
model_2 (Model)                 (None, 5)            82245       input_24[0][0]                   
__________________________________________________________________________________________________
RNN_MIT_Bidirectional (Model)   (None, 5)            244805      input_24[0][0]                   
__________________________________________________________________________________________________
average (Average)               (None, 5)            0           Baseline_MIT[1][0]               
                                                                 Conv_RNN_MIT_Bidirectional[1][0] 
                                                                 model_2[1][0]                    
                                                                 RNN_MIT_Bidirectional[1][0]      
==================================================================================================
Total params: 709,204
Trainable params: 708,564
Non-trainable params: 640
__________________________________________________________________________________________________
