{"class_name": "Model", "config": {"name": "RNN_Transfer_Retrain_Bidirectional", "layers": [{"name": "input_78", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 187, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_78"}, "inbound_nodes": []}, {"name": "bidirectional_66", "class_name": "Bidirectional", "config": {"name": "bidirectional_66", "trainable": true, "dtype": "float32", "layer": {"class_name": "CuDNNLSTM", "config": {"name": "cu_dnnlstm_24", "trainable": true, "dtype": null, "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "time_major": false, "units": 100, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null}}, "merge_mode": "concat"}, "inbound_nodes": [[["input_78", 0, 0, {}]]]}, {"name": "dense_24", "class_name": "Dense", "config": {"name": "dense_24", "trainable": true, "dtype": "float32", "units": 200, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["bidirectional_66", 0, 0, {}]]]}, {"name": "dropout_107", "class_name": "Dropout", "config": {"name": "dropout_107", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "inbound_nodes": [[["dense_24", 0, 0, {}]]]}, {"name": "out_layer", "class_name": "Dense", "config": {"name": "out_layer", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_107", 0, 0, {}]]]}], "input_layers": [["input_78", 0, 0]], "output_layers": [["out_layer", 0, 0]]}, "keras_version": "2.2.4-tf", "backend": "tensorflow"}