Model: "RNN_Transfer_Retrain_Bidirectional"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_78 (InputLayer)        [(None, 187, 1)]          0         
_________________________________________________________________
bidirectional_66 (Bidirectio (None, 200)               82400     
_________________________________________________________________
dense_24 (Dense)             (None, 200)               40200     
_________________________________________________________________
dropout_107 (Dropout)        (None, 200)               0         
_________________________________________________________________
out_layer (Dense)            (None, 1)                 201       
=================================================================
Total params: 122,801
Trainable params: 122,801
Non-trainable params: 0
_________________________________________________________________
