Model: "RNN_PTB_Bidirectional"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_2 (InputLayer)         [(None, 187, 1)]          0         
_________________________________________________________________
bidirectional_1 (Bidirection (None, 300)               183600    
_________________________________________________________________
dense_1 (Dense)              (None, 200)               60200     
_________________________________________________________________
dropout_1 (Dropout)          (None, 200)               0         
_________________________________________________________________
out_layer (Dense)            (None, 1)                 201       
=================================================================
Total params: 244,001
Trainable params: 244,001
Non-trainable params: 0
_________________________________________________________________
