Accuracy:      0.9955341806939196
F1:            0.994425931973186
Confusion mat:
 [[ 800    9]
 [   4 2098]]
Acc per class: [0.98887515 0.99809705]
AUROC:    0.9934861024699533
AUPRC:    0.9952078010474017

Model: "model_45"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_61 (InputLayer)           [(None, 187, 1)]     0                                            
__________________________________________________________________________________________________
conv1d_412 (Conv1D)             (None, 183, 32)      192         input_61[0][0]                   
__________________________________________________________________________________________________
batch_normalization_181 (BatchN (None, 183, 32)      128         conv1d_412[0][0]                 
__________________________________________________________________________________________________
re_lu_144 (ReLU)                (None, 183, 32)      0           batch_normalization_181[0][0]    
__________________________________________________________________________________________________
conv1d_414 (Conv1D)             (None, 183, 32)      3104        re_lu_144[0][0]                  
__________________________________________________________________________________________________
batch_normalization_182 (BatchN (None, 183, 32)      128         conv1d_414[0][0]                 
__________________________________________________________________________________________________
re_lu_145 (ReLU)                (None, 183, 32)      0           batch_normalization_182[0][0]    
__________________________________________________________________________________________________
conv1d_415 (Conv1D)             (None, 183, 32)      3104        re_lu_145[0][0]                  
__________________________________________________________________________________________________
add_90 (Add)                    (None, 183, 32)      0           conv1d_415[0][0]                 
                                                                 conv1d_412[0][0]                 
__________________________________________________________________________________________________
batch_normalization_183 (BatchN (None, 183, 32)      128         add_90[0][0]                     
__________________________________________________________________________________________________
re_lu_146 (ReLU)                (None, 183, 32)      0           batch_normalization_183[0][0]    
__________________________________________________________________________________________________
conv1d_416 (Conv1D)             (None, 183, 32)      3104        re_lu_146[0][0]                  
__________________________________________________________________________________________________
batch_normalization_184 (BatchN (None, 183, 32)      128         conv1d_416[0][0]                 
__________________________________________________________________________________________________
re_lu_147 (ReLU)                (None, 183, 32)      0           batch_normalization_184[0][0]    
__________________________________________________________________________________________________
conv1d_417 (Conv1D)             (None, 183, 32)      3104        re_lu_147[0][0]                  
__________________________________________________________________________________________________
add_91 (Add)                    (None, 183, 32)      0           conv1d_417[0][0]                 
                                                                 add_90[0][0]                     
__________________________________________________________________________________________________
batch_normalization_185 (BatchN (None, 183, 32)      128         add_91[0][0]                     
__________________________________________________________________________________________________
re_lu_148 (ReLU)                (None, 183, 32)      0           batch_normalization_185[0][0]    
__________________________________________________________________________________________________
conv1d_418 (Conv1D)             (None, 183, 32)      3104        re_lu_148[0][0]                  
__________________________________________________________________________________________________
batch_normalization_186 (BatchN (None, 183, 32)      128         conv1d_418[0][0]                 
__________________________________________________________________________________________________
re_lu_149 (ReLU)                (None, 183, 32)      0           batch_normalization_186[0][0]    
__________________________________________________________________________________________________
conv1d_419 (Conv1D)             (None, 183, 32)      3104        re_lu_149[0][0]                  
__________________________________________________________________________________________________
add_92 (Add)                    (None, 183, 32)      0           conv1d_419[0][0]                 
                                                                 add_91[0][0]                     
__________________________________________________________________________________________________
batch_normalization_187 (BatchN (None, 183, 32)      128         add_92[0][0]                     
__________________________________________________________________________________________________
re_lu_150 (ReLU)                (None, 183, 32)      0           batch_normalization_187[0][0]    
__________________________________________________________________________________________________
conv1d_420 (Conv1D)             (None, 183, 32)      3104        re_lu_150[0][0]                  
__________________________________________________________________________________________________
batch_normalization_188 (BatchN (None, 183, 32)      128         conv1d_420[0][0]                 
__________________________________________________________________________________________________
re_lu_151 (ReLU)                (None, 183, 32)      0           batch_normalization_188[0][0]    
__________________________________________________________________________________________________
conv1d_421 (Conv1D)             (None, 183, 32)      3104        re_lu_151[0][0]                  
__________________________________________________________________________________________________
add_93 (Add)                    (None, 183, 32)      0           conv1d_421[0][0]                 
                                                                 add_92[0][0]                     
__________________________________________________________________________________________________
conv1d_422 (Conv1D)             (None, 183, 32)      5152        add_93[0][0]                     
__________________________________________________________________________________________________
conv1d_413 (Conv1D)             (None, 183, 32)      5152        conv1d_412[0][0]                 
__________________________________________________________________________________________________
add_94 (Add)                    (None, 183, 32)      0           conv1d_422[0][0]                 
                                                                 conv1d_413[0][0]                 
__________________________________________________________________________________________________
batch_normalization_189 (BatchN (None, 183, 32)      128         add_94[0][0]                     
__________________________________________________________________________________________________
conv1d_423 (Conv1D)             (None, 181, 256)     24832       batch_normalization_189[0][0]    
__________________________________________________________________________________________________
global_max_pooling1d_33 (Global (None, 256)          0           conv1d_423[0][0]                 
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 64)           16448       global_max_pooling1d_33[0][0]    
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 64)           4160        dense_1[0][0]                    
__________________________________________________________________________________________________
output_layer (Dense)            (None, 1)            65          dense_2[0][0]                    
==================================================================================================
Total params: 81,985
Trainable params: 81,409
Non-trainable params: 576
__________________________________________________________________________________________________

=================================================================
Accuracy:      0.9955341806939196
F1:            0.994425931973186
Confusion mat:
 [[ 800    9]
 [   4 2098]]
Acc per class: [0.98887515 0.99809705]
AUROC:    0.9934861024699533
AUPRC:    0.9952078010474017


=================================================================
