Accuracy: 0.992442459635864
F1:       0.9905777578471114
AUROC:    0.9902047493763665
AUPRC:    0.9930015829486245

Model: "model_20"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_27 (InputLayer)        [(None, 187, 1)]          0         
_________________________________________________________________
conv1d_144 (Conv1D)          (None, 185, 16)           64        
_________________________________________________________________
conv1d_145 (Conv1D)          (None, 183, 16)           784       
_________________________________________________________________
max_pooling1d_50 (MaxPooling (None, 91, 16)            0         
_________________________________________________________________
dropout_74 (Dropout)         (None, 91, 16)            0         
_________________________________________________________________
conv1d_146 (Conv1D)          (None, 89, 32)            1568      
_________________________________________________________________
conv1d_147 (Conv1D)          (None, 87, 32)            3104      
_________________________________________________________________
max_pooling1d_51 (MaxPooling (None, 43, 32)            0         
_________________________________________________________________
dropout_75 (Dropout)         (None, 43, 32)            0         
_________________________________________________________________
batch_normalization_10 (Batc (None, 43, 32)            128       
_________________________________________________________________
rnn (CuDNNGRU)               (None, 150)               82800     
_________________________________________________________________
dense (Dense)                (None, 200)               30200     
_________________________________________________________________
out_layer (Dense)            (None, 1)                 201       
=================================================================
Total params: 118,849
Trainable params: 118,785
Non-trainable params: 64
_________________________________________________________________
