Accuracy:      0.9893507385778083
F1:            0.9866256627626504
Confusion mat:
 [[ 783   26]
 [   5 2097]]
Acc per class: [0.96786156 0.99762131]
AUROC:    0.9827414352567865
AUPRC:    0.987121246660631

Model: "model_51"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_69 (InputLayer)           [(None, 187, 1)]     0                                            
__________________________________________________________________________________________________
conv1d_460 (Conv1D)             (None, 183, 32)      192         input_69[0][0]                   
__________________________________________________________________________________________________
batch_normalization_201 (BatchN (None, 183, 32)      128         conv1d_460[0][0]                 
__________________________________________________________________________________________________
re_lu_160 (ReLU)                (None, 183, 32)      0           batch_normalization_201[0][0]    
__________________________________________________________________________________________________
conv1d_462 (Conv1D)             (None, 183, 32)      3104        re_lu_160[0][0]                  
__________________________________________________________________________________________________
batch_normalization_202 (BatchN (None, 183, 32)      128         conv1d_462[0][0]                 
__________________________________________________________________________________________________
re_lu_161 (ReLU)                (None, 183, 32)      0           batch_normalization_202[0][0]    
__________________________________________________________________________________________________
conv1d_463 (Conv1D)             (None, 183, 32)      3104        re_lu_161[0][0]                  
__________________________________________________________________________________________________
add_100 (Add)                   (None, 183, 32)      0           conv1d_463[0][0]                 
                                                                 conv1d_460[0][0]                 
__________________________________________________________________________________________________
batch_normalization_203 (BatchN (None, 183, 32)      128         add_100[0][0]                    
__________________________________________________________________________________________________
re_lu_162 (ReLU)                (None, 183, 32)      0           batch_normalization_203[0][0]    
__________________________________________________________________________________________________
conv1d_464 (Conv1D)             (None, 183, 32)      3104        re_lu_162[0][0]                  
__________________________________________________________________________________________________
batch_normalization_204 (BatchN (None, 183, 32)      128         conv1d_464[0][0]                 
__________________________________________________________________________________________________
re_lu_163 (ReLU)                (None, 183, 32)      0           batch_normalization_204[0][0]    
__________________________________________________________________________________________________
conv1d_465 (Conv1D)             (None, 183, 32)      3104        re_lu_163[0][0]                  
__________________________________________________________________________________________________
add_101 (Add)                   (None, 183, 32)      0           conv1d_465[0][0]                 
                                                                 add_100[0][0]                    
__________________________________________________________________________________________________
batch_normalization_205 (BatchN (None, 183, 32)      128         add_101[0][0]                    
__________________________________________________________________________________________________
re_lu_164 (ReLU)                (None, 183, 32)      0           batch_normalization_205[0][0]    
__________________________________________________________________________________________________
conv1d_466 (Conv1D)             (None, 183, 32)      3104        re_lu_164[0][0]                  
__________________________________________________________________________________________________
batch_normalization_206 (BatchN (None, 183, 32)      128         conv1d_466[0][0]                 
__________________________________________________________________________________________________
re_lu_165 (ReLU)                (None, 183, 32)      0           batch_normalization_206[0][0]    
__________________________________________________________________________________________________
conv1d_467 (Conv1D)             (None, 183, 32)      3104        re_lu_165[0][0]                  
__________________________________________________________________________________________________
add_102 (Add)                   (None, 183, 32)      0           conv1d_467[0][0]                 
                                                                 add_101[0][0]                    
__________________________________________________________________________________________________
batch_normalization_207 (BatchN (None, 183, 32)      128         add_102[0][0]                    
__________________________________________________________________________________________________
re_lu_166 (ReLU)                (None, 183, 32)      0           batch_normalization_207[0][0]    
__________________________________________________________________________________________________
conv1d_468 (Conv1D)             (None, 183, 32)      3104        re_lu_166[0][0]                  
__________________________________________________________________________________________________
batch_normalization_208 (BatchN (None, 183, 32)      128         conv1d_468[0][0]                 
__________________________________________________________________________________________________
re_lu_167 (ReLU)                (None, 183, 32)      0           batch_normalization_208[0][0]    
__________________________________________________________________________________________________
conv1d_469 (Conv1D)             (None, 183, 32)      3104        re_lu_167[0][0]                  
__________________________________________________________________________________________________
add_103 (Add)                   (None, 183, 32)      0           conv1d_469[0][0]                 
                                                                 add_102[0][0]                    
__________________________________________________________________________________________________
conv1d_470 (Conv1D)             (None, 183, 32)      5152        add_103[0][0]                    
__________________________________________________________________________________________________
conv1d_461 (Conv1D)             (None, 183, 32)      5152        conv1d_460[0][0]                 
__________________________________________________________________________________________________
add_104 (Add)                   (None, 183, 32)      0           conv1d_470[0][0]                 
                                                                 conv1d_461[0][0]                 
__________________________________________________________________________________________________
batch_normalization_209 (BatchN (None, 183, 32)      128         add_104[0][0]                    
__________________________________________________________________________________________________
conv1d_471 (Conv1D)             (None, 181, 256)     24832       batch_normalization_209[0][0]    
__________________________________________________________________________________________________
global_max_pooling1d_37 (Global (None, 256)          0           conv1d_471[0][0]                 
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 64)           16448       global_max_pooling1d_37[0][0]    
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 64)           4160        dense_1[0][0]                    
__________________________________________________________________________________________________
output_layer (Dense)            (None, 1)            65          dense_2[0][0]                    
==================================================================================================
Total params: 81,985
Trainable params: 20,673
Non-trainable params: 61,312
__________________________________________________________________________________________________
