Accuracy:      0.9876210487849443
F1:            0.9247886171438431
Confusion mat:
 [[18086    20     9     1     2]
 [  120   426     9     0     1]
 [   38     2  1393    13     2]
 [   24     0    16   122     0]
 [   13     0     1     0  1594]]
Acc per class: [0.9982338  0.76618705 0.96201657 0.75308642 0.99129353]
Model: "ensemble"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_56 (InputLayer)           [(None, 187, 1)]     0                                            
__________________________________________________________________________________________________
Baseline_MIT (Model)            (None, 5)            254901      input_56[0][0]                   
__________________________________________________________________________________________________
model_27 (Model)                (None, 5)            119653      input_56[0][0]                   
__________________________________________________________________________________________________
model_2 (Model)                 (None, 5)            82245       input_56[0][0]                   
__________________________________________________________________________________________________
average_13 (Average)            (None, 5)            0           Baseline_MIT[1][0]               
                                                                 model_27[1][0]                   
                                                                 model_2[1][0]                    
==================================================================================================
Total params: 456,799
Trainable params: 456,159
Non-trainable params: 640
__________________________________________________________________________________________________
