Accuracy:      0.9955341806939196
F1:            0.994430188223814
Confusion mat:
 [[ 801    8]
 [   5 2097]]
Acc per class: [0.99011125 0.99762131]
AUROC:    0.9938662807450435
AUPRC:    0.9955475009263368

Model: "ensemble"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_60 (InputLayer)           [(None, 187, 1)]     0                                            
__________________________________________________________________________________________________
Baseline_PTB (Model)            (None, 1)            254641      input_60[0][0]                   
__________________________________________________________________________________________________
model_20 (Model)                (None, 1)            118849      input_60[0][0]                   
__________________________________________________________________________________________________
model_26 (Model)                (None, 1)            81985       input_60[0][0]                   
__________________________________________________________________________________________________
average_14 (Average)            (None, 1)            0           Baseline_PTB[1][0]               
                                                                 model_20[1][0]                   
                                                                 model_26[1][0]                   
==================================================================================================
Total params: 455,475
Trainable params: 454,835
Non-trainable params: 640
__________________________________________________________________________________________________
