Accuracy:      0.9881691942262013
F1:            0.9301317020102392
Confusion mat:
 [[18042    52    14     6     4]
 [   79   465     9     2     1]
 [   26     5  1401    13     3]
 [   14     0    18   130     0]
 [   13     0     0     0  1595]]
Acc per class: [0.99580528 0.83633094 0.96754144 0.80246914 0.99191542]
Model: "Ensemble_NNEnsemble_MIT"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_65 (InputLayer)           [(None, 187, 1)]     0                                            
__________________________________________________________________________________________________
Baseline_MIT (Model)            (None, 5)            254901      input_65[0][0]                   
__________________________________________________________________________________________________
model_27 (Model)                (None, 5)            119653      input_65[0][0]                   
__________________________________________________________________________________________________
model_2 (Model)                 (None, 5)            82245       input_65[0][0]                   
__________________________________________________________________________________________________
concatenate_4 (Concatenate)     (None, 15)           0           Baseline_MIT[1][0]               
                                                                 model_27[1][0]                   
                                                                 model_2[1][0]                    
__________________________________________________________________________________________________
dense (Dense)                   (None, 64)           1024        concatenate_4[0][0]              
__________________________________________________________________________________________________
y (Dense)                       (None, 5)            325         dense[0][0]                      
==================================================================================================
Total params: 458,148
Trainable params: 1,349
Non-trainable params: 456,799
__________________________________________________________________________________________________
