Accuracy:      0.9872099397040015
F1:            0.9262947740471763
Confusion mat:
 [[18048    39    22     7     2]
 [  100   442    11     2     1]
 [   31     5  1398    11     3]
 [   19     0    14   129     0]
 [   11     0     2     0  1595]]
Acc per class: [0.99613644 0.79496403 0.96546961 0.7962963  0.99191542]
Model: "Conv_LSTM_MIT_Bidirectional"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_87 (InputLayer)        [(None, 187, 1)]          0         
_________________________________________________________________
conv1d_206 (Conv1D)          (None, 185, 16)           64        
_________________________________________________________________
conv1d_207 (Conv1D)          (None, 183, 16)           784       
_________________________________________________________________
max_pooling1d_88 (MaxPooling (None, 91, 16)            0         
_________________________________________________________________
dropout_120 (Dropout)        (None, 91, 16)            0         
_________________________________________________________________
conv1d_208 (Conv1D)          (None, 89, 32)            1568      
_________________________________________________________________
conv1d_209 (Conv1D)          (None, 87, 32)            3104      
_________________________________________________________________
max_pooling1d_89 (MaxPooling (None, 43, 32)            0         
_________________________________________________________________
dropout_121 (Dropout)        (None, 43, 32)            0         
_________________________________________________________________
batch_normalization_64 (Batc (None, 43, 32)            128       
_________________________________________________________________
bidirectional_75 (Bidirectio (None, 300)               220800    
_________________________________________________________________
dense (Dense)                (None, 200)               60200     
_________________________________________________________________
out_layer (Dense)            (None, 5)                 1005      
=================================================================
Total params: 287,653
Trainable params: 287,589
Non-trainable params: 64
_________________________________________________________________
