Accuracy: 0.7220886293369976
F1:       0.4193097945342111
AUROC:    0.5
AUPRC:    0.7220886293369976

Model: "model_18"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_26 (InputLayer)        [(None, 187, 1)]          0         
_________________________________________________________________
cu_dnnlstm_7 (CuDNNLSTM)     (None, 150)               91800     
_________________________________________________________________
dense_7 (Dense)              (None, 200)               30200     
_________________________________________________________________
dropout_73 (Dropout)         (None, 200)               0         
_________________________________________________________________
out_layer (Dense)            (None, 1)                 201       
=================================================================
Total params: 122,201
Trainable params: 122,201
Non-trainable params: 0
_________________________________________________________________
