{"class_name": "Model", "config": {"name": "model_18", "layers": [{"name": "input_26", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 187, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_26"}, "inbound_nodes": []}, {"name": "cu_dnnlstm_7", "class_name": "CuDNNLSTM", "config": {"name": "cu_dnnlstm_7", "trainable": true, "dtype": "float32", "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "time_major": false, "units": 150, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_26", 0, 0, {}]]]}, {"name": "dense_7", "class_name": "Dense", "config": {"name": "dense_7", "trainable": true, "dtype": "float32", "units": 200, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["cu_dnnlstm_7", 0, 0, {}]]]}, {"name": "dropout_73", "class_name": "Dropout", "config": {"name": "dropout_73", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "inbound_nodes": [[["dense_7", 0, 0, {}]]]}, {"name": "out_layer", "class_name": "Dense", "config": {"name": "out_layer", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_73", 0, 0, {}]]]}], "input_layers": [["input_26", 0, 0]], "output_layers": [["out_layer", 0, 0]]}, "keras_version": "2.2.4-tf", "backend": "tensorflow"}