Model: "Ensemble_NNEnsemble_PTB_Bidirectional"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_9 (InputLayer)            [(None, 187, 1)]     0                                            
__________________________________________________________________________________________________
Baseline_PTB (Model)            (None, 1)            254641      input_9[0][0]                    
__________________________________________________________________________________________________
RNN_PTB_Bidirectional (Model)   (None, 1)            122801      input_9[0][0]                    
__________________________________________________________________________________________________
Conv_RNN_PTB_Bidirectional (Mod (None, 1)            126449      input_9[0][0]                    
__________________________________________________________________________________________________
model_26 (Model)                (None, 1)            81985       input_9[0][0]                    
__________________________________________________________________________________________________
Baseline_Transfer_Retrain (Mode (None, 1)            254641      input_9[0][0]                    
__________________________________________________________________________________________________
RNN_Transfer_Retrain_Bidirectio (None, 1)            122801      input_9[0][0]                    
__________________________________________________________________________________________________
Conv_RNN_Transfer_Retrain_Bidir (None, 1)            126449      input_9[0][0]                    
__________________________________________________________________________________________________
model_45 (Model)                (None, 1)            81985       input_9[0][0]                    
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 8)            0           Baseline_PTB[1][0]               
                                                                 RNN_PTB_Bidirectional[1][0]      
                                                                 Conv_RNN_PTB_Bidirectional[1][0] 
                                                                 model_26[1][0]                   
                                                                 Baseline_Transfer_Retrain[1][0]  
                                                                 RNN_Transfer_Retrain_Bidirectiona
                                                                 Conv_RNN_Transfer_Retrain_Bidirec
                                                                 model_45[1][0]                   
__________________________________________________________________________________________________
dense (Dense)                   (None, 64)           576         concatenate[0][0]                
__________________________________________________________________________________________________
y (Dense)                       (None, 1)            65          dense[0][0]                      
==================================================================================================
Total params: 1,172,393
Trainable params: 641
Non-trainable params: 1,171,752
__________________________________________________________________________________________________
