Model: "Baseline_PTB"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_4 (InputLayer)         [(None, 187, 1)]          0         
_________________________________________________________________
conv1d_24 (Conv1D)           (None, 183, 16)           96        
_________________________________________________________________
conv1d_25 (Conv1D)           (None, 179, 16)           1296      
_________________________________________________________________
max_pooling1d_9 (MaxPooling1 (None, 89, 16)            0         
_________________________________________________________________
dropout_12 (Dropout)         (None, 89, 16)            0         
_________________________________________________________________
conv1d_26 (Conv1D)           (None, 87, 32)            1568      
_________________________________________________________________
conv1d_27 (Conv1D)           (None, 85, 32)            3104      
_________________________________________________________________
max_pooling1d_10 (MaxPooling (None, 42, 32)            0         
_________________________________________________________________
dropout_13 (Dropout)         (None, 42, 32)            0         
_________________________________________________________________
conv1d_28 (Conv1D)           (None, 40, 32)            3104      
_________________________________________________________________
conv1d_29 (Conv1D)           (None, 38, 32)            3104      
_________________________________________________________________
max_pooling1d_11 (MaxPooling (None, 19, 32)            0         
_________________________________________________________________
dropout_14 (Dropout)         (None, 19, 32)            0         
_________________________________________________________________
conv1d_30 (Conv1D)           (None, 17, 256)           24832     
_________________________________________________________________
conv1d_31 (Conv1D)           (None, 15, 256)           196864    
_________________________________________________________________
global_max_pooling1d_3 (Glob (None, 256)               0         
_________________________________________________________________
dropout_15 (Dropout)         (None, 256)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 64)                16448     
_________________________________________________________________
dense_2 (Dense)              (None, 64)                4160      
_________________________________________________________________
dense_3_mitbih (Dense)       (None, 1)                 65        
=================================================================
Total params: 254,641
Trainable params: 254,641
Non-trainable params: 0
_________________________________________________________________
