Accuracy:      0.9965647543799382
F1:            0.9957138936397775
Confusion mat:
 [[ 802    7]
 [   3 2099]]
Acc per class: [0.99134734 0.99857279]
AUROC:    0.9949600651095726
AUPRC:    0.996284268670129

Model: "Conv_RNN_Transfer_Retrain_Bidirectional"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_80 (InputLayer)        [(None, 187, 1)]          0         
_________________________________________________________________
conv1d_194 (Conv1D)          (None, 185, 16)           64        
_________________________________________________________________
conv1d_195 (Conv1D)          (None, 183, 16)           784       
_________________________________________________________________
max_pooling1d_82 (MaxPooling (None, 91, 16)            0         
_________________________________________________________________
dropout_110 (Dropout)        (None, 91, 16)            0         
_________________________________________________________________
conv1d_196 (Conv1D)          (None, 89, 32)            1568      
_________________________________________________________________
conv1d_197 (Conv1D)          (None, 87, 32)            3104      
_________________________________________________________________
max_pooling1d_83 (MaxPooling (None, 43, 32)            0         
_________________________________________________________________
dropout_111 (Dropout)        (None, 43, 32)            0         
_________________________________________________________________
batch_normalization_61 (Batc (None, 43, 32)            128       
_________________________________________________________________
bidirectional_68 (Bidirectio (None, 200)               80400     
_________________________________________________________________
dense (Dense)                (None, 200)               40200     
_________________________________________________________________
out_layer (Dense)            (None, 1)                 201       
=================================================================
Total params: 126,449
Trainable params: 126,385
Non-trainable params: 64
_________________________________________________________________

=================================================================
Accuracy:      0.9965647543799382
F1:            0.9957138936397775
Confusion mat:
 [[ 802    7]
 [   3 2099]]
Acc per class: [0.99134734 0.99857279]
AUROC:    0.9949600651095726
AUPRC:    0.996284268670129


=================================================================
