Accuracy:      0.7255238749570594
F1:            0.4369486778192945
Confusion mat:
 [[  14  795]
 [   4 2098]]
Acc per class: [0.01730532 0.99809705]
AUROC:    0.5077011828160596
AUPRC:    0.7251928372035336

Model: "model_61"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_81 (InputLayer)        [(None, 187, 1)]          0         
_________________________________________________________________
cu_dnnlstm_15 (CuDNNLSTM)    (None, 150)               91800     
_________________________________________________________________
dense_15 (Dense)             (None, 200)               30200     
_________________________________________________________________
dropout_137 (Dropout)        (None, 200)               0         
_________________________________________________________________
out_layer (Dense)            (None, 1)                 201       
=================================================================
Total params: 122,201
Trainable params: 30,401
Non-trainable params: 91,800
_________________________________________________________________
