Accuracy:      0.9580900034352456
F1:            0.9478682989842053
Confusion mat:
 [[ 750   59]
 [  63 2039]]
Acc per class: [0.92707046 0.97002854]
AUROC:    0.9485495007991682
AUPRC:    0.9643914285849665

Model: "Baseline_Transfer_Freeze"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_63 (InputLayer)        [(None, 187, 1)]          0         
_________________________________________________________________
conv1d_432 (Conv1D)          (None, 183, 16)           96        
_________________________________________________________________
conv1d_433 (Conv1D)          (None, 179, 16)           1296      
_________________________________________________________________
max_pooling1d_86 (MaxPooling (None, 89, 16)            0         
_________________________________________________________________
dropout_110 (Dropout)        (None, 89, 16)            0         
_________________________________________________________________
conv1d_434 (Conv1D)          (None, 87, 32)            1568      
_________________________________________________________________
conv1d_435 (Conv1D)          (None, 85, 32)            3104      
_________________________________________________________________
max_pooling1d_87 (MaxPooling (None, 42, 32)            0         
_________________________________________________________________
dropout_111 (Dropout)        (None, 42, 32)            0         
_________________________________________________________________
conv1d_436 (Conv1D)          (None, 40, 32)            3104      
_________________________________________________________________
conv1d_437 (Conv1D)          (None, 38, 32)            3104      
_________________________________________________________________
max_pooling1d_88 (MaxPooling (None, 19, 32)            0         
_________________________________________________________________
dropout_112 (Dropout)        (None, 19, 32)            0         
_________________________________________________________________
conv1d_438 (Conv1D)          (None, 17, 256)           24832     
_________________________________________________________________
conv1d_439 (Conv1D)          (None, 15, 256)           196864    
_________________________________________________________________
global_max_pooling1d_35 (Glo (None, 256)               0         
_________________________________________________________________
dropout_113 (Dropout)        (None, 256)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 64)                16448     
_________________________________________________________________
dense_2 (Dense)              (None, 64)                4160      
_________________________________________________________________
dense_3_mitbih (Dense)       (None, 1)                 65        
=================================================================
Total params: 254,641
Trainable params: 20,673
Non-trainable params: 233,968
_________________________________________________________________
