Accuracy:      0.9948471315699072
F1:            0.9935634568857745
Confusion mat:
 [[ 798   11]
 [   4 2098]]
Acc per class: [0.98640297 0.99809705]
AUROC:    0.9922500085268137
AUPRC:    0.9942653319124568

Model: "Ensemble_NNEnsemble_PTB"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_69 (InputLayer)           [(None, 187, 1)]     0                                            
__________________________________________________________________________________________________
Baseline_PTB (Model)            (None, 1)            254641      input_69[0][0]                   
__________________________________________________________________________________________________
model_20 (Model)                (None, 1)            118849      input_69[0][0]                   
__________________________________________________________________________________________________
model_26 (Model)                (None, 1)            81985       input_69[0][0]                   
__________________________________________________________________________________________________
concatenate_5 (Concatenate)     (None, 3)            0           Baseline_PTB[1][0]               
                                                                 model_20[1][0]                   
                                                                 model_26[1][0]                   
__________________________________________________________________________________________________
dense (Dense)                   (None, 64)           256         concatenate_5[0][0]              
__________________________________________________________________________________________________
y (Dense)                       (None, 1)            65          dense[0][0]                      
==================================================================================================
Total params: 455,796
Trainable params: 321
Non-trainable params: 455,475
__________________________________________________________________________________________________
