Accuracy: 0.8854832815640417
F1: 0.44427342587411867

Model: "model_23"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_34 (InputLayer)        (None, 187, 1)            0         
_________________________________________________________________
cu_dnnlstm_12 (CuDNNLSTM)    (None, 150)               91800     
_________________________________________________________________
dense_19 (Dense)             (None, 200)               30200     
_________________________________________________________________
dropout_91 (Dropout)         (None, 200)               0         
_________________________________________________________________
out_layer (Dense)            (None, 5)                 1005      
=================================================================
Total params: 123,005
Trainable params: 123,005
Non-trainable params: 0
_________________________________________________________________
