{"class_name": "Model", "config": {"name": "model_23", "layers": [{"name": "input_34", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 187, 1], "dtype": "float32", "sparse": false, "name": "input_34"}, "inbound_nodes": []}, {"name": "cu_dnnlstm_12", "class_name": "CuDNNLSTM", "config": {"name": "cu_dnnlstm_12", "trainable": true, "dtype": "float32", "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "units": 150, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_34", 0, 0, {}]]]}, {"name": "dense_19", "class_name": "Dense", "config": {"name": "dense_19", "trainable": true, "dtype": "float32", "units": 200, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["cu_dnnlstm_12", 0, 0, {}]]]}, {"name": "dropout_91", "class_name": "Dropout", "config": {"name": "dropout_91", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "inbound_nodes": [[["dense_19", 0, 0, {}]]]}, {"name": "out_layer", "class_name": "Dense", "config": {"name": "out_layer", "trainable": true, "dtype": "float32", "units": 5, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_91", 0, 0, {}]]]}], "input_layers": [["input_34", 0, 0]], "output_layers": [["out_layer", 0, 0]]}, "keras_version": "2.2.5", "backend": "tensorflow"}